#Задание_№1
исходная_строка = "zyzyzyzyxxaxzazy"
 
новая_строка = ""

for x in исходная_строка:
    if x == "y":
        новая_строка += "x"
    else:
        новая_строка += x

print(исходная_строка)
print(новая_строка)

#задание_№2    

числа = [1,2,3,4,5,6,7,8,9,10,15,20,30,60,120]

произведение = 5
    
for x in числа:
    if x // 15 == x / 15:
        произведение *= x

print(произведение)
    
#Задание_№3    

строка = 'xxxxxxyyyyyzzzz'
print(строка.replace('x','y'))



    
    
    
    
    
    
    
